app/controllers/application_controller.rb

  def load_menu_categories
    @array_categories = Category.parent_category.to_a
---
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL