app/controllers/products_controller.rb

  def index
    @category_id = params[:category]
    @type_sort = params[:type_sort]

    if @category_sort.blank? && @type_sort.blank?
      @products = Product.sort_product_updated.paginate(page: params[:page],
       per_page: Settings.paginate_for.sort_page)
---
SELECT  "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def rating
    load_product
    update = @product.ratings.find_by(user_id: current_user.id)

    if update.blank?
      Rating.create!(user_id: current_user.id,
       product_id: @product.id, rating: params[:point])
    else
      update.update_attributes(rating: params[:point])
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ? AND "ratings"."product_id" = ? LIMIT ?  [["user_id", 1], ["product_id", 9], ["LIMIT", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."product_id" = ?  [["product_id", 4]]
INSERT INTO "ratings" ("user_id", "product_id", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["product_id", 4], ["rating", 5], ["created_at", "2018-10-04 13:01:28.027684"], ["updated_at", "2018-10-04 13:01:28.027684"]]
UPDATE "ratings" SET "rating" = ?, "updated_at" = ? WHERE "ratings"."id" = ?  [["rating", 4], ["updated_at", "2018-10-03 13:05:37.780109"], ["id", 10]]

  def load_product
    @product = Product.find_by(id: params[:id])
    return if @product.present?
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? ORDER BY "products"."created_at" DESC LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]