app/controllers/static_pages_controller.rb

  def home
    @hot = Product.all.take(Settings.static_pages.product_quantity)
---
SELECT  "products".* FROM "products" INNER JOIN "order_details" ON "order_details"."product_id" = "products"."id" GROUP BY order_details.id ORDER BY count(order_details.product_id) DESC LIMIT ?  [["LIMIT", 12]]