app/controllers/suggestions_controller.rb

  def create
    @suggest = Suggestion.new suggest_param
    return unless @suggest.save
---
INSERT INTO "suggestions" ("name", "description", "cartegory_id", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ahihi"], ["description", "ahihi"], ["cartegory_id", 1], ["image", "321"], ["created_at", "2018-10-03 04:23:12.341528"], ["updated_at", "2018-10-03 04:23:12.341528"]]